Documents/АнализРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>АнализРеализации</Name>
			<Comment>По результату 26 счета (ПН\Перемещение)</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.umk_ВидыОперацийАнализовРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Comment>МестоХранения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокПеремещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоОстатокСрокРеализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоДобавитьПН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоПереместить</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриходнаяНакладная</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРеализации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоОстатокНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоОстатокКонец</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвоПНТекущегоДня</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/umk_ДопРеквизитыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>umk_ДопРеквизитыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БлокироватьВыписку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БлокироватьПроизводство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокументаУК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокументаУК1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокументаУК2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьКодС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУК1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУК2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУК</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУК1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУК2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонечныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонечныйСрок1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонечныйСрок2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримСтр1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримСтр2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/umk_ВидыОперацийАнализовРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>umk_ВидыОперацийАнализовРеализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоОприходование</Name>
					<Comment>Дополнительное оприходование</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АнализРеализации/Ext/ObjectModule.bsl
Перем ПерваяЗапись;

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ВидОперации = Перечисления.umk_ВидыОперацийАнализовРеализации.Перемещение
		Тогда
		
		Если ЗначениеЗаполнено(ДокПеремещение) Тогда
			 Перемещение = ДокПеремещение.ПолучитьОбъект(); 
			 Перемещение.Записать(РежимЗаписиДокумента.Проведение);
		КонеЦЕсли;
		
	КонецЕсли;
	
	Если ВидОперации = Перечисления.umk_ВидыОперацийАнализовРеализации.ДоОприходование
		Тогда
		
		ТаблицаОПЗ = Новый ТаблицаЗначений;
		ТаблицаОПЗ.Колонки.Добавить("ОПЗ");
		
		Для Каждого СтрокаТовары Из Товары Цикл
			Если Не ЗначениеЗаполнено(СтрокаТовары.ПриходнаяНакладная) Тогда
				//Сообщить(СтрокаТовары.Продукция)
				Продолжить;
			КонецЕсли;
			
			ДокПоступление  = СтрокаТовары.ПриходнаяНакладная.ПолучитьОбъект();
			
			ПараметрыПоиска = Новый Структура("Номенклатура", СтрокаТовары.Продукция); 
			НайденныеСтроки = ДокПоступление.Продукция.НайтиСтроки(ПараметрыПоиска);
			
			Для Каждого Строка Из НайденныеСтроки Цикл
				
				Строка.Количество =  Строка.Количество + СтрокаТовары.КвоДобавитьПН;
				Строка.КоличествоДоп =  Строка.КоличествоДоп + СтрокаТовары.КвоДобавитьПН;
				Строка.АнализРеализации =  СокрЛП(Строка.АнализРеализации) + СокрЛП(Номер)+ " ("+ Дата + ")" +  ", ";			
				Сообщить("ОПЗ - " + Строка(ДокПоступление) + " ТМЦ: " 
				+ СтрокаТовары.Продукция + " Изменено кво-доб: " 
				+ СтрокаТовары.КвоДобавитьПН);
				ДокПоступление.Записать(РежимЗаписиДокумента.Запись);
				
				НоваяСтрока = ТаблицаОПЗ.Добавить();
				НоваяСтрока.ОПЗ = ДокПоступление.Ссылка;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ТаблицаОПЗ.Свернуть("ОПЗ");
		
		Для Каждого СтрокаОПЗ Из ТаблицаОПЗ Цикл
			
			Документ = СтрокаОПЗ.ОПЗ.ПолучитьОбъект();
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ВидОперации = Перечисления.umk_ВидыОперацийАнализовРеализации.Перемещение
		Тогда
		
		Если ЗначениеЗаполнено(ДокПеремещение) Тогда
			 Перемещение = ДокПеремещение.ПолучитьОбъект(); 
			 Перемещение.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонеЦЕсли;
		
	КонецЕсли;
	
	Если ВидОперации = Перечисления.umk_ВидыОперацийАнализовРеализации.ДоОприходование
		Тогда
		
		ТаблицаОПЗ = Новый ТаблицаЗначений;
		ТаблицаОПЗ.Колонки.Добавить("ОПЗ");

		Для Каждого СтрокаТовары Из Товары Цикл
			Если Не ЗначениеЗаполнено(СтрокаТовары.ПриходнаяНакладная) Тогда
				Продолжить;
			КонецЕсли;
			
			ДокПоступление  = СтрокаТовары.ПриходнаяНакладная.ПолучитьОбъект();
			
			ПараметрыПоиска = Новый Структура("Номенклатура", СтрокаТовары.Продукция); 
			НайденныеСтроки = ДокПоступление.Продукция.НайтиСтроки(ПараметрыПоиска);
			
			Для Каждого Строка Из НайденныеСтроки Цикл
				
					Строка.Количество =  Строка.Количество - СтрокаТовары.КвоДобавитьПН;
					Если  Строка.Количество = 0 Тогда
						Сообщить("Документ " + Строка(ДокПоступление) + ", в стоке №" + Строка(Строка.НомерСтроки) + " для " + Строка(Строка.Номенклатура) + " количество равно 0.", СтатусСообщения.ОченьВажное);
					КонецЕсли;
					//Строка.Количество = ?(Строка.Количество = 0, КратностьКутера(Строка.Номенклатура, ДокПоступление.Дата), Строка.Количество);
					//Строка.КоличествоДоп =  Строка.КоличествоДоп - СтрокаТовары.КвоДобавитьПН;
					//--- Почистить этот анализ из списка	
					СтрокаЧистить = СокрЛП(Номер)+ " ("+ Дата + ")" +  ", ";
					Строка.АнализРеализации = СтрЗаменить(Строка.АнализРеализации, СтрокаЧистить, "");			
					ДокПоступление.Записать(РежимЗаписиДокумента.Запись);
					Сообщить("Очищена ОПЗ - " + ДокПоступление + " ТМЦ: " 
					+ СтрокаТовары.Продукция + "  удалено кво-доб: "
					+ СтрокаТовары.КвоДобавитьПН);
					
					НоваяСтрока = ТаблицаОПЗ.Добавить();
     				НоваяСтрока.ОПЗ = ДокПоступление.Ссылка;

					
			КонецЦикла;
			
		КонецЦикла;
		
		ТаблицаОПЗ.Свернуть("ОПЗ");
		
		Для Каждого СтрокаОПЗ Из ТаблицаОПЗ Цикл
			
			Документ = СтрокаОПЗ.ОПЗ.ПолучитьОбъект();
			Документ.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
	
	КонецЕсли;	
	
КонецПроцедуры

Функция КратностьКутера(Номенклатура, Период)
	
	КратностьКутера = 0.001;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	umk_ДопРеквизитыНоменклатурыСрезПоследних.Выход
		|ИЗ
		|	РегистрСведений.umk_ДопРеквизитыНоменклатуры.СрезПоследних(&Период, Номенклатура = &Объект) КАК umk_ДопРеквизитыНоменклатурыСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		    КратностьКутера = Выборка.Выход * Номенклатура.umk_КратностьКутера; 
	КонецЕсли;

	Возврат КратностьКутера
	
КонецФункции

Процедура ПриКопировании()
	
   ДокПеремещение = Документы.ПеремещениеТоваров.ПустаяСсылка();	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ПерваяЗапись Тогда
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Отказ = Проведен; // Повторное проведенин
		КонецЕсли;
	КонецЕсли;
	ПерваяЗапись = Ложь;
КонецПроцедуры

ПерваяЗапись = Истина;
